-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 20 2017 г., 19:47
-- Версия сервера: 5.6.34
-- Версия PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u133919365_nps`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(2) NOT NULL,
  `title` varchar(255) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `title`) VALUES
(1, 'Кросворди'),
(2, 'Пазли'),
(3, 'Загадки'),
(4, 'Анекдоти'),
(5, 'Цитати'),
(6, 'Цікаві факти'),
(7, 'Звичайний текст');

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(5) NOT NULL,
  `post` int(5) NOT NULL,
  `author` varchar(100) NOT NULL,
  `text` text NOT NULL,
  `date` date NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `post`, `author`, `text`, `date`) VALUES
(1, 2, 'Максим', 'Все супер! Мені подобається', '2017-03-01'),
(2, 2, 'Віка', 'Ого, вперше таке бачу! Супер!', '2017-03-02'),
(3, 19, 'Василь', 'Файна гра!', '2017-03-22'),
(4, 19, 'Василь', 'Файна гра!', '2017-03-22'),
(5, 5, 'Віталік', 'Прочитав. Мені полюбилося', '2017-03-22'),
(6, 21, 'Павлик', 'Файна гра! 4 години проходив але пройшов!!', '2017-03-22'),
(7, 25, 'Игорь', 'Тест', '2017-03-22'),
(8, 20, '111', '222', '2017-03-22'),
(9, 20, '123', '321', '2017-03-22'),
(10, 1, 'Іван', 'Надзвичайно талановита жінка!', '2017-03-22'),
(11, 6, 'Макс', 'Цікава стаття', '2017-03-22'),
(12, 8, 'Василь', 'Гарна стаття', '2017-03-23'),
(13, 75, '111', '222', '2017-03-23'),
(14, 75, 'qqq', 'wwww', '2017-03-23'),
(15, 0, 'qqqqq', 'qqqq', '2017-03-23'),
(16, 75, 'qqqqq', 'qqqqqqq', '2017-03-23'),
(17, 75, '!!!!!!!!!!', '&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;&amp;', '2017-03-23'),
(18, 2, 'Вася', 'Круто', '2017-03-23'),
(19, 24, 'Юрій', 'Трохи складно', '2017-03-24'),
(20, 5, 'Юрій', 'Дійсно цікава інформація', '2017-03-24'),
(21, 6, 'Алекс', '111', '2017-04-19'),
(22, 6, 'Алекс', '111', '2017-04-19'),
(23, 6, 'Алекс', '111', '2017-04-19');

-- --------------------------------------------------------

--
-- Структура таблицы `comments_setting`
--

CREATE TABLE `comments_setting` (
  `id` int(1) NOT NULL,
  `img` varchar(255) NOT NULL,
  `sum` int(5) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments_setting`
--

INSERT INTO `comments_setting` (`id`, `img`, `sum`) VALUES
(1, 'blocks/img/capcha/1.png', 5256);

-- --------------------------------------------------------

--
-- Структура таблицы `comments_t`
--

CREATE TABLE `comments_t` (
  `id` int(5) NOT NULL,
  `post` int(5) NOT NULL,
  `author` varchar(100) NOT NULL,
  `text` text NOT NULL,
  `date` date NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `data`
--

CREATE TABLE `data` (
  `id` int(5) NOT NULL,
  `cat` int(1) NOT NULL,
  `description` text NOT NULL,
  `text` text NOT NULL,
  `view` int(7) NOT NULL,
  `date` date NOT NULL,
  `mini_img` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `url` varchar(255) NOT NULL,
  `author` varchar(50) NOT NULL,
  `id_l` int(2) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `data`
--

INSERT INTO `data` (`id`, `cat`, `description`, `text`, `view`, `date`, `mini_img`, `title`, `url`, `author`, `id_l`) VALUES
(43, 2, 'Дуже цікава гра!', ' ', 26, '2017-03-22', 'blocks/img/no_img.jpg', 'Історії іграшок', 'http://188.226.185.236/logic/f/2230.swf', '', 0),
(25, 2, 'Опис 5', '0', 30, '2017-02-07', '', 'Флінстоуни', 'http://345-games.ru/wp-content/uploads/2011/10/flinstones.swf', '', 0),
(24, 2, 'Опис 4', '0', 15, '2016-06-21', '', 'Вінні Пух та його друзі', 'http://345-games.ru/wp-content/uploads/2012/01/puzzle_vinni_puh.swf', '', 0),
(23, 2, 'Опис 3', '0', 14, '2016-12-05', '', 'Білосніжка та 7 гномів', 'http://345-games.ru/wp-content/uploads/2012/01/pazl_belosnegka.swf', '', 0),
(22, 2, 'Опис 2', '0', 8, '2016-12-07', '', 'Том і Джеррі', 'http://345-games.ru/wp-content/uploads/2012/03/puzzle_Tom_Jerry.swf', '', 0),
(21, 2, 'Опис для першого пазлу', '0', 20, '2016-01-06', '', 'Бронтозавр', 'http://345-games.ru/wp-content/uploads/2012/09/brontosaurus.swf', '', 0),
(20, 1, 'Опис для другого кросворду', '0', 41, '2017-02-07', '', 'Назва кросворду №2', 'http://www.doshkolniki.com/crossvord/odezhda.swf', '', 0),
(19, 1, 'Опис для першого кросворду', '0', 36, '2017-03-07', '', 'Назва кросворду №1', 'http://levko.info/games/Levko_krosvord_ukr.swf', '', 0),
(103, 3, '_', '18', 3, '2017-04-19', 'admin/img/files/667456821657.jpg', 'Яке число слід поставити замість знаку питання?', 'http://...', '', 0),
(102, 3, '_', 'Людина', 30, '2017-04-19', 'admin/img/files/4404646262335.jpg', 'Що незвичайного на фото?', 'http://...', '', 0),
(8, 4, 'Кращі анекдоти про Вовочку!', '<p align=\"center\"><strong>Якось у ванній</strong></p>\r\n  <p>Дівчинка виходить із ванної і говорить Вовочці:<br>\r\n    - В тебе в ванній висять два рушники: один під буквою «М», другий під буквою «Ж».<br>\r\n    Я взяла те, що під буквою «Ж».<br>\r\n    Я правильно розуміла, «Ж» – для жінок, «М» – для мужчин.<br>\r\n    - Ні, «М» – для морди…<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Яблука</strong></p>\r\n  <p>Вчителька біології запитує:<br>\r\n    - Коли треба збирати яблука?<br>\r\n    Петя:<br>\r\n    - У серпні!<br>\r\n    Маша:<br>\r\n    - У вересні!<br>\r\n    Вовочка:<br>\r\n    - Коли собака прив’язана!<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Вовочка</strong></p>\r\n  <p>Вовочка, сильно спізнившись, стоїть перед вчителькою:<br>\r\n    - Що сталось?<br>\r\n    - Hа мене напав озброєний бандит!<br>\r\n    - О, Боже! І що він зробив?<br>\r\n    - Відняв домашнє завдання.<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Пташка нашептала</strong></p>\r\n  <p>Тато говорить Вовочці:<br>\r\n    - Мені пташка нашептала, що ти, синку, наркотиками балуєшся.<br>\r\n    - Це ти, тату, балуєшся, якщо тобі пташки шепочуть.<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Цегла</strong></p>\r\n  <p>Мама каже Вовочці:<br>\r\n    - Вовочка, ти знову кидав у дядю Мішу цеглою.<br>\r\n    - Мам я більше не буду.<br>\r\n    - А йому більше і не треба.</p>', 42, '2016-08-16', '', 'Про Вовочку!', '', '', 0),
(7, 4, 'Тут зібрані найкращі анекдоти про тварин зі всієї мережі', '<p align=\"center\"><strong>Крокодил</strong></p>\r\n  <p>Сидить мужик на риболовлі і пильно дивиться на поплавок, повз пропливає крокодил. Побачивши рибалку, дивиться на нього. Через хвилину крокодил запитує:<br>\r\n    - Що, мужик, не клює?<br>\r\n    Мужик відповідає:<br>\r\n    - Ні.<br>\r\n    Крокодил:<br>\r\n    - Може поки скупаєшся?<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Ведмідь і заєць</strong></p>\r\n  <p>Зловили ведмідь і заєць золоту рибку, рибка їм каже:<br>\r\n    - Я виконаю ваші 3 бажання кожному.<br>\r\n    Ведмідь каже:<br>\r\n    - Хочу, щоб у моєму лісі всі ведмеді стали бабами.<br>\r\n    Заєць:<br>\r\n    - Хочу мотоцикл.<br>\r\n    Ведмідь:<br>\r\n    - Хочу, щоб у сусідніх лісах всі ведмеді стали бабами.<br>\r\n    Заєць:<br>\r\n    - Хочу шолом до мотоцикла.<br>\r\n    Ведмідь:<br>\r\n    - Хочу, щоб у всьому світі всі ведмеді стали бабами.<br>\r\n    Сідає заєць на мотоцикл, їде і кричить:<br>\r\n    - Хочу, щоб ведмідь став голубим.<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Обережно, у дворі злий папуга</strong></p>\r\n  <p>Прокидається мужик з будуна і бачить-у нього на грудях сидить бобер, мокрий, з хвостом і зубами. Мужик його запитує:<br>\r\n    - Ти чого тут?<br>\r\n    Той відповідає людським голосом:<br>\r\n    - Вас алкашів вже стільки розвелося, що білок на всіх не вистачає!<br>\r\n  </p>\r\n  <p align=\"center\"><strong>Кицюня</strong></p>\r\n  <p>- Мерзота, ти створений з єдиною цілю – прислужувати мені, твоєму панові! Слухайся мене, або я знищу тебе і весь твій рід!<br>\r\n    - Кицюня, кицюня, що ти там мявкаєш? Їсти хочеш? Іди до мене, кис-кис-кис…</p>', 16, '2016-05-21', '', 'Анекдоти про тварин', '', '', 0),
(6, 6, 'Стародавній Рим можна вважати колискою європейської культури. А також стародавні римляни знамениті своїми вільними вдачами...', ' <p><img src=\"blocks/img/fact2.jpg\" width=\"300\" height=\"213\" style=\"float:left; vertical-align: top\">Стародавній Рим можна вважати колискою європейської культури. А також стародавні римляни знамениті своїми вільними вдачами: одностатеві зв\'язки, групові оргії там були в порядку речей. На стінах багатьох будинків були зображені відверті сексуальні сцени. Це римляни вважали об\'єктом поклоніння і захоплення.<br>\r\n    <br>\r\n    У Стародавньому Римі проституція , була однією з найпоширеніших жіночих професій. Там були спеціальні бронзові монети , якими оплачувалися послуги повій - спінтрії . На <img src=\"http://tut-cikavo.com/images/banners/moneta_Rima_01-300x156.jpg\" alt=\"Цікаві факти про Стародавній Рим\" title=\"Цікаві факти про Стародавній Рим\" border=\"0\" style=\"float:right; vertical-align: top\">цих грошах були зображені еротичні сцени - як правило , люди в різноманітних позах в момент статевого акту. На самій вершині « платної любові » панували куртизанки - це були незвичайні повії. Куртизанки мали привілейованих коханців , вони впливали на культурне , а також суспільне життя і, звичайно , були оточені розкішшю.<br>\r\n    <br>\r\n    У Стародавньому Римі існувала проблема перенаселеності , тому будинки росли не тільки в ширину , але і у висоту , і за указом імператора Августа будівлі не повинні перевищувати 21 метр , ці будинки називали Інсула .<br>\r\n    <br>\r\n    <br>\r\n    Давньоримська публіка любила криваві видовища не тільки на гладіаторських боях , а й на звичайних театральних виставах. Якщо по ходу дії актор повинен був загинути , його могли в останній момент замінити на засудженого до страти злочинця і вбити прямо на сцені.</p>\r\n  <div>\r\n    <div id=\"yandex_rtb_R-A-191367-3\"><strong>Деякі дивні факти про Стародавній Рим:</strong><br>\r\n      <br>\r\n  • Раби у Давньому Римі становили до 40 % населення.  </div>\r\n  </div>\r\n  <p>    • У Стародавньому Римі , якщо пацієнт помирав під час операції , лікарю відрізали руки.</p>\r\n  <p>    • Форуми , це місця в Стародавньому Римі , де люди розмовляли про політику і релігію , це було щось на зразок місць для мітингів.</p>\r\n  <p>    • Спаржа була улюбленицею римського народу , вони тримали її замороженою в Альпах , щоб зберегти всю її свіжість.</p>\r\n  <p>    • Колізей був найбільшою ареною в той час , він міг вмістити більше 200 000 чоловік .</p>\r\n  <p>    • У Стародавньому Римі , тільки хлопчики ходили в школу , а дівчатка залишалися вдома і вчилися від своїх матерів.</p>\r\n  <p>    • Римський імператор Нерон одружився на чоловікові - одному зі своїх рабів по імені Скорус .</p>\r\n  <p>    • У Стародавньому Римі вважалося , що у людини , у якої ніс з горбинкою , є великий потенціал лідера .</p>\r\n  <p>    • На древніх змаганнях з боротьби у Римі було тільки одне правило - не видавлювати очі .</p>\r\n  <p>    • За часів Римської імперії вважалося , що введення слонячого посліду в піхву практично попереджає вагітність .</p>\r\n  <p>    • Іноді для лікування безпліддя римські лікарі рекомендували пити кров повалених гладіаторів .</p>\r\n  <p>    • Стародавні єгиптяни і римляни використовували мед замість золота для виплати податків</p>\r\n  <p>    • Саме римляни придумали бетон. Акведуки і купольні конструкції були відлиті саме з бетону.</p>\r\n  <p>    • Масло вони використовували як лікарський засіб , а молоко - як косметичний засіб .</p>\r\n  <p>    • У стародавньому Римі сіль підносили кожному гостю на знак дружби.</p>\r\n  <p>    • Язики фламінго вважалися делікатесом на римських банкетах .</p>\r\n  <p>    • Стародавні римляни їли руками . У багатих громадян були спеціальні раби , об волосся яких витирали руки після їжі .</p>\r\n  <p>    • Гай Юлій Цезар з задоволенням користувався присвоєним йому правом постійно носити лавровий вінок , так як в нього почалося облисіння.</p>\r\n  <p>    • Високосний рік ввів Гай Юлій Цезар.</p>', 51, '2016-07-15', 'blocks/img/fact2.jpg', 'Цікаві факти про Стародавній Рим', '', '', 0),
(5, 6, 'Людський організм являє собою суцільні таємниці та загадки. З цієї статті ви дізнаєтеся кілька цікавих фактів, про які практично ніхто не замислюється.', '<p align=\"center\"><img src=\"blocks/img/fact1.jpg\" width=\"290\" height=\"174\"></p>\n  <p>Людський організм являє собою суцільні таємниці та загадки. З цієї статті ви дізнаєтеся кілька цікавих фактів, про які практично ніхто не замислюється.</p>\n  <p><strong>1. Чи відомо вам, що ви частково сліпі?</strong> <br>\n      <br>\n    Людське око має маленьку несправність, на яку ніхто не звертає уваги: називається вона «сліпа пляма». Такою особливістю наділене як ліве око, так і праве. «Сліпа пляма» - це таке місце, яке не здатне сприймати світло. Це місце досить велике і воно доставляє масу неприємностей людям, які позбавлені здатності бачити одним оком. А от якщо із зором все гаразд, то таке місце, як \"сліпа пляма\" залишається абсолютно непоміченим. <br>\n    <br>\n    <strong>2. Наше тіло вкрите шерстю так само, як і шимпанзе.</strong> <br>\n    <br>\n    Ніхто не задумається про те, що людське тіло вкрите волосяним покровом, будова якого ні чим не відрізняється він покриву багатьох приматів. Наш волосяний покрив відрізняється від шерсті приматів тільки довжиною, а так само товщиною волосся. А от їх кількість так само, як і місце розташування, ні чим не відрізняються. <br>\n    <br>\n    <strong>3. Людський організм на багато молодший, ніж ми самі.</strong> <br>\n    <br>\n    Людина постійно переживає процеси зміни. Задумайтеся: адже ми дихаємо, вживаємо їжу, організм очищається, ми хворіємо і так далі. Тіло не здатне повторити само себе до попереднього стану. Так само організм весь час оновлюється. Протягом всього нашого життя клітини помирають у величезних кількостях, а на їх місці з\'являються нові. Чим більше пройшло часу з моменту статевого дозрівання, тим менше в організмі залишається клітин, які ви мали з дитячого віку. Цікавий факт: філософи всіх народів ведуть нескінченні дискусії на тему «чи може людина назвати себе собою, якщо клітини, якими був наділений організм при появі на світ, давно померли, а на їх місці з\'явилися нові?»</p>\n  <div></div>\n  <br>\n  <br>\n  <p><strong>4. Людське тіло має смуги.</strong> <br>\n  <br>\n  Шкіра людини має плями і чіткі лінії, які ми не бачимо. Це можна порівняти, наприклад, з шерстю кішки. Такі лінії мають назву Лінії Блашко. Прийнято вважати, що вони утворюються у зв\'язку з міграцією у ембріона шкірних клітин. Це можна назвати свого роду шаблонами, за якими можна зрозуміти, як розвивалася шкіра дитини. Як правило, дані лінії не можуть збігатися з малюнком як лімфатичної, так і м\'язової систем. Їх форма обумовлюється генетично. Лінії Блашко можна помітити тільки в тому випадку, якщо людина має таке захворювання, як лишай, різновиди невуса, а так само хімеризм.</p>\n  <br>\n  <p><br>\n      <strong>5. Людський шлунок на багато розумніший, ніж ми припускаємо. </strong><br>\n    <br>\n    Доведено, що в шлунково-кишковому тракті нейтронів набагато більше, ніж в мозку у багатьох тварин. Оскільки їх кількість велика, а значимість відома всім, то цілком можна сказати, що в шлунку є другий мозок. <br>\n    <br>\n    <strong>6. До складу ДНК людини входять віруси. </strong><br>\n    <br>\n    У той час, коли геном людини був розкритий, таке твердження, як віруси у складі ДНК, стало величезним сюрпризом. Відомо, що віруси не здатні розмножуватися самостійно. З цієї причини багато вірусів «вбудовують» свою власну ДНК у клітину господаря для того, щоб бути скопійованими. Наприклад, якщо вірус вставить свою ДНК в клітину яйцеклітини, по потомство, отримане з цієї яйцеклітини, може нести ДНК вірусу в кожній зі своїх яйцеклітин. Еволюція не стоїть на місці. У результаті вийшло, що не менше ніж 9% нашого геному становлять віруси. <br>\n    <br>\n    <strong>7. Людина здатна рахувати не рахуючи. </strong><br>\n    <br>\n    Людина наділена інтуїтивним розумінням кількості. Це діє тільки в тому випадку, якщо рахованих  об\'єктів не більше чотирьох. Рахувати абсолютно не обов\'язково для того, щоб зрозуміти, що перед вами знаходиться два або ж три об\'єкти. До речі, плем\'я Пираха не має такого поняття, як рахунок предметів. Але навіть вони на інтуїтивному рівні здатні зрозуміти кількість.</p>', 27, '2017-02-13', 'blocks/img/fact1.jpg', 'Цікаві факти про вас, про які ви не замислювались.', '', '', 0),
(2, 5, 'Василь Стус', '  <ul>\n    <li> Ми досі ще рятуємо дистрофію тіл, а за прогресуючу дистрофію душ — нам байдуже.</li>\n    </ul>\n  <p align=\"center\"><img src=\"blocks/img/stus.jpg\" width=\"274\" height=\"400\"></p>\n  <ul>\n    <li>Терпи, терпи — терпець тебе шліфує.</li>\n    <li>Це щастя: мати таку долю, як у мене…Чуюся добре, бо нікому не зробив зла, бо дбав не тільки про себе. І від того мені світло на душі.</li>\n    <li>Кожен так любить червоне вино, нагріте до 36 градусів.<br>\n      Лиш мати вміє жити, аби світитися, немов зоря.</li>\n  </ul>\n  <p><br>\n  </p>\n  <p></p>', 48, '2017-03-17', 'blocks/img/stus.jpg', 'Цитати Василя Стуса', '', '', 1),
(1, 5, 'Найкращі цитати Ліни Костенко!', '<p>Цитати Ліни Костенко</p>\r\n  <ul>\r\n    <li>Людям не те що позакладало вуха – людям позакладало душі.</li>\r\n    </ul>  \r\n  <p align=\"center\"><img src=\"blocks/img/lina-kostenko.jpg\" width=\"300\" height=\"387\"></p>\r\n  <ul>\r\n    <li>Я Вас люблю. О як я Вас люблю! Але про це не треба говорити.</li>\r\n    <li>Скільки років кохаю, а закохуюсь в тебе щодня.</li>\r\n    <li>Жінки довше переживають образу, незалежно від того, вони образили чи їх ображено.</li>\r\n    <li>Коли пролітала комета Галлея – мені здалося, що вона озирнулася на нас, і зареготала.<br>\r\n    </li>\r\n  </ul>\r\n  <p></p>', 14, '2016-08-21', 'blocks/img/lina-kostenko.jpg', 'Цитати Ліни Костенко', '', '', 1),
(105, 5, '2', '3', 0, '2017-04-19', 'admin/img/files/969938kym.gif', '1111', 'http://...', '', 1),
(106, 5, '111', '222', 1, '2017-04-19', 'admin/img/files/31938kym.gif', 'Тест2', 'http://...', '', 2),
(107, 5, '111', '222', 0, '2017-04-19', 'admin/img/files/955938kym.gif', 'Тест2', 'http://...', '', 2),
(108, 5, '111', '222', 1, '2017-04-19', 'admin/img/files/409938kym.gif', 'Тест2', 'http://...', '', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `data_in_m`
--

CREATE TABLE `data_in_m` (
  `id` int(4) NOT NULL,
  `cat` int(2) NOT NULL,
  `description` varchar(255) NOT NULL,
  `text` text NOT NULL,
  `view` int(4) NOT NULL,
  `date` date NOT NULL,
  `mini_img` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `url` varchar(255) NOT NULL,
  `author` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `options`
--

CREATE TABLE `options` (
  `id` int(2) NOT NULL,
  `str` int(2) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `options`
--

INSERT INTO `options` (`id`, `str`) VALUES
(1, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `id` int(3) NOT NULL,
  `title` varchar(255) NOT NULL,
  `text` text NOT NULL,
  `page` varchar(255) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `settings`
--

INSERT INTO `settings` (`id`, `title`, `text`, `page`) VALUES
(1, 'Цікавинки', '<p>Дорогий відвідувачу, цей сайт пропонує Вашій увазі багато корисної та сумної, гумористичної та пізнавальної інформації з оточуючого нас світу, а також декілька захоплюючих розваг, які тренують і розвивають память та увагу.</p>\r\n<p>Тут Ви обовязково знайдете для себе щось цікаве та дивовижне, тому відвідуйте нас кожного дня - ми збираємо, відбираємо і публікуємо тільки найкраще з усього світу!</p>', 'index'),
(2, 'Авторські права', '<p>Весь матеріал, представлений на сайті gamepaper.ru, взятий з відкритих джерел або присланий відвідувачами сайту.</p>\r\n<p>Матеріал використовується виключно в некомерційних цілях. Всі права на матеріали належать їх власникам.</p> \r\n<p>Якщо Ви є автором матеріалу або володарем авторських прав на нього і проти його використання на сайті gamepaper.ru, будь ласка, Результаты поиска зв\"яжіться з нами за адресою - chill.out.and.be.calm@gmail.com</p>', 'about'),
(3, 'Цікаві факти', 'Тут зібрані найцікавіші факти', 'facts'),
(4, 'Кросворди', 'Ми зібрали для тебе найкращі кросворди!', 'cross'),
(5, 'Пазли', 'Неймовірні пазли!', 'puzz'),
(6, 'Загадки', 'Різноманітні загадки', 'zag'),
(7, 'Анекдоти', 'Лише кращі анекдоти для тебе!', 'joke'),
(8, 'Цитати', 'Колекція відбірних цитат!', 'quote'),
(9, 'Напишіть нам', 'Форма зворотнього звязку', 'mail_page'),
(10, 'Контакти', 'Якась інформація', 'contacts');

-- --------------------------------------------------------

--
-- Структура таблицы `userlist`
--

CREATE TABLE `userlist` (
  `id` int(11) NOT NULL,
  `user` varchar(50) NOT NULL,
  `pass` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `userlist`
--

INSERT INTO `userlist` (`id`, `user`, `pass`) VALUES
(1, 'admin', 'admin');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(2) NOT NULL,
  `login` varchar(50) NOT NULL,
  `pass` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `pass`) VALUES
(1, 'admin', 'admin'),
(2, 'василь', '12345'),
(3, 'Акакій', '12345'),
(4, 'Назар', '1111'),
(5, 'Sound', 'Sound'),
(6, 'Юрій', '123'),
(7, 'Алекс', '1111');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comments_setting`
--
ALTER TABLE `comments_setting`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comments_t`
--
ALTER TABLE `comments_t`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `data`
--
ALTER TABLE `data`
  ADD PRIMARY KEY (`id`);
ALTER TABLE `data` ADD FULLTEXT KEY `text` (`text`);
ALTER TABLE `data` ADD FULLTEXT KEY `text_2` (`text`);
ALTER TABLE `data` ADD FULLTEXT KEY `description` (`description`);
ALTER TABLE `data` ADD FULLTEXT KEY `title` (`title`);
ALTER TABLE `data` ADD FULLTEXT KEY `description_2` (`description`);

--
-- Индексы таблицы `data_in_m`
--
ALTER TABLE `data_in_m`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `options`
--
ALTER TABLE `options`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `userlist`
--
ALTER TABLE `userlist`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
--
-- AUTO_INCREMENT для таблицы `comments_setting`
--
ALTER TABLE `comments_setting`
  MODIFY `id` int(1) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `comments_t`
--
ALTER TABLE `comments_t`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT для таблицы `data`
--
ALTER TABLE `data`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;
--
-- AUTO_INCREMENT для таблицы `data_in_m`
--
ALTER TABLE `data_in_m`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT для таблицы `options`
--
ALTER TABLE `options`
  MODIFY `id` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT для таблицы `userlist`
--
ALTER TABLE `userlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
